app/Controllers/Articulos.php

INSERT INTO `articulos` (`nombre`, `marca`, `precio`) VALUES ('camion', 'hunday', '300000€')
---
     public function guardar(){
         $data= [];
         $data ['nombre'] = $this-> request -> getPost ('nombre');
         $data ['marca'] = $this-> request -> getPost ('marca');
         $data ['precio'] = $this-> request -> getPost ('precio');

         $imagen = $this->request->getFile('imagen');
         $nombreimagen = $imagen->getRandomName();
         $imagen->move('../public/imagenes', $nombreimagen);
         if ($imagen === false) {
            // Log the error message
            log_message('error', $imagen->getErrorString());
        }

         $modelo = model(ArticulosModel::class);

         $modelo->save($data);