app/Controllers/tiendas.php

SELECT *
FROM `articulos`
ORDER BY `id` DESC
 LIMIT 1
---
    public function ver_tienda(): string
    {

        $modelo = new \App\Models\ArticulosModel();



        $imagen = $modelo->orderBy('id', 'DESC')->first();