app/Controllers/Usuarios.php

INSERT INTO `usuario` (`nombre`, `contraseña`) VALUES ('pedro', 'pedro')
---
    public function agregar(): string
    {
        $usuario = $this->request->getPost('usuario');
        $password = $this->request->getPost('password');

        $modelo = model(UsuariosModel::class);

        // Preparamos los datos a guardar:
        $data['nombre'] = $usuario;
        $data['contraseña'] = $password;

        // Realizamos la consulta
        $articulos = $modelo->save($data);